% Παράμετροι συστήματος
m = 0.8;
g = 9.81;
l = 0.3;
Ixx = 15.67e-3;
Iyy = 15.67e-3;
Izz = 28.34e-3;
b = 192.32e-7;
d = 4e-7;

% Αρχικές συνθήκες
phi_0 = 0.02;
phi_dot_0 = 0.01;
th_0 = 0;
th_dot_0 = 0;
psi_0 = 0;
psi_dot_0 = 0;

x_0 = 0.1;
x_dot_0 = 0;
y_0 = 0;
y_dot_0 = 0;
z_0 = 0;
z_dot_0 = 0;

% Μετατροπή Ω^2 σε U
Omega_sq_2_U = [b  b  b  b;
                0 -b  0  b;
               -b  0  b  0;
                d -d  d -d];
U_to_Omega_sq = inv(Omega_sq_2_U);

% Υπολογισμός ισορροπίας
syms U1 U2 U3 U4
eq1 = U1 == m*g; % Ισορροπία στον άξονα z
eq2 = U2 == 0;   % Ισορροπία γύρω από τον άξονα x
eq3 = U3 == 0;   % Ισορροπία γύρω από τον άξονα y
eq4 = U4 == 0;   % Ισορροπία γύρω από τον άξονα z

% Επίλυση
solutions = solve([eq1, eq2, eq3, eq4], [U1, U2, U3, U4]);

% Προβολή αποτελεσμάτων
disp('Σημεία ισορροπίας:')
disp(solutions)
