% Μητρώα συστήματος
A = [ % Προσθήκη του A από τη γραμμικοποίηση
    0     0     0     1     0     0     0     0     0     0     0     0;
    0     0     0     0     1     0     0     0     0     0     0     0;
    0     0     0     0     0     1     0     0     0     0     0     0;
    0     0     0     0     0     0     0     0     0     0     0     0;
    0     0     0     0     0     0     0     0     0     0     0     0;
    0     0     0     0     0     0     0     0     0     0     0     0;
    0     0     0     0     0     0     0     0     0     0     0     0;
    0     0     0     0     0     0     0     0     0     0     0     0;
    0     0     0     0     0     0     0     0     0     0     0     0;
    0     0     0     0     0     0     0     0     0     0     0     0;
    0     0     0     0     0     0     0     0     0     0     0     0;
    0     0     0     0     0     0     0     0     0     0     0     0
];

B = [ % Προσθήκη του B από τη γραμμικοποίηση
    0         0         0         0;
    0         0         0         0;
    0         0         0         0;
    1.25      0         0         0;
    0    63.8162        0         0;
    0         0    63.8162        0;
    0         0         0    35.2858;
    0         0         0         0;
    0         0         0         0;
    0         0         0         0;
    0         0         0         0;
    0         0         0         0
];

C = [
    1 0 0 0 0 0 0 0 0 0 0 0;
    0 1 0 0 0 0 0 0 0 0 0 0;
    0 0 1 0 0 0 0 0 0 0 0 0;
    0 0 0 0 0 0 0 0 1 0 0 0
];

D = zeros(4, 4);

% Δημιουργία συστήματος χώρου καταστάσεων
sys = ss(A, B, C, D);

% Υπολογισμός πίνακα μεταφοράς
G = tf(sys);

% Εμφάνιση πίνακα μεταφοράς
disp('Πίνακας Μεταφοράς:')
G
